systemtest/testcases_services/test_wcps/queries/03-soap_simple_count.xml

<?xml version="1.0" encoding="UTF-8" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
    <env:Header/>
    <env:Body>
  <ProcessCoveragesRequest xmlns="http://www.opengis.net/wcps/1.0" service="WCPS" version="1.0.0">
  <query><xmlSyntax><coverageIterator><iteratorVar>c</iteratorVar><coverageName>test_rgb</coverageName></coverageIterator><count><equals><fieldSelect><coverage>c</coverage><field><name>1</name></field></fieldSelect><numericConstant>0</numericConstant></equals></count></xmlSyntax></query></ProcessCoveragesRequest>
    </env:Body>
</env:Envelope>
